import Link from "next/link";
import styles from "./styles.module.scss";
import { url } from "@/api/domain";

const MobileShopItem = (data) => {

    


    const formatNumberWithThousandSeparator = (number) => {
        return number?.toString().replace(/\B(?=(\d{3})+(?!\d))/g, ",");
    }


    return(
        <Link href={"/product/" + data?.slug}>
            <div className={styles.shopItem + " bg-white p-2 rounded-lg flex flex-col justify-between"} style={{width: "136px" , height: "254px" , minWidth: "136px"}}>
                <div className={styles.top}>
                    <div className={styles.header + " flex items-center justify-between flex-row-reverse"}>
                        <div className={styles.imagesNumber + " flex flex-row-reverse items-center gap-1"}>
                            <svg xmlns="http://www.w3.org/2000/svg" width="10" height="10" viewBox="0 0 10 10" fill="none">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M3.38609 2.08333C3.74443 1.5795 4.33357 1.25 4.99998 1.25C5.66639 1.25 6.25553 1.5795 6.61387 2.08333H8.43748C8.84019 2.08333 9.16665 2.40979 9.16665 2.8125V8.02083C9.16665 8.42354 8.84019 8.75 8.43748 8.75H1.56248C1.15977 8.75 0.833313 8.42354 0.833313 8.02083V2.8125C0.833313 2.40979 1.15977 2.08333 1.56248 2.08333H3.38609ZM4.99998 3.75C4.19456 3.75 3.54165 4.40292 3.54165 5.20833C3.54165 6.01375 4.19456 6.66667 4.99998 6.66667C5.8054 6.66667 6.45831 6.01375 6.45831 5.20833C6.45831 4.40292 5.8054 3.75 4.99998 3.75Z" fill="#E14957"/>
                            </svg>
                            <span className="text-[10px] text-[#E14957]">
                                ۴
                            </span>
                        </div>
                        <div className={styles.icon}>
                            <svg xmlns="http://www.w3.org/2000/svg" width="13" height="13" viewBox="0 0 13 13" fill="none">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M0.541687 7.17704C0.541687 6.95267 0.723571 6.77079 0.947937 6.77079H2.3021C2.52647 6.77079 2.70835 6.95267 2.70835 7.17704C2.70835 7.4014 2.52647 7.58329 2.3021 7.58329H0.947937C0.723571 7.58329 0.541687 7.4014 0.541687 7.17704Z" fill="#AEAEAE"/>
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M1.57085 4.22495C1.70547 4.04546 1.96011 4.00908 2.1396 4.1437L3.22294 4.9562C3.40243 5.09082 3.43881 5.34546 3.30419 5.52495C3.16957 5.70445 2.91493 5.74082 2.73544 5.6062L1.6521 4.7937C1.47261 4.65908 1.43623 4.40445 1.57085 4.22495Z" fill="#AEAEAE"/>
                                <path d="M9.96955 2.2179C9.39957 1.64791 8.47543 1.64791 7.90545 2.2179L5.73878 4.38456C5.16879 4.95455 5.16879 5.87868 5.73878 6.44867C6.30877 7.01866 7.2329 7.01866 7.80289 6.44867L8.59896 5.6526L10.9523 8.00596C11.111 8.16461 11.3682 8.16461 11.5268 8.00596C11.6855 7.84731 11.6855 7.59009 11.5268 7.43144L9.17348 5.07807L9.96955 4.282C10.5395 3.71202 10.5395 2.78788 9.96955 2.2179Z" fill="#AEAEAE"/>
                                <path d="M3.74417 8.93745C2.86986 8.93745 2.09364 9.49692 1.81716 10.3264L1.73846 10.5625H1.4896C1.26524 10.5625 1.08335 10.7443 1.08335 10.9687C1.08335 11.1931 1.26524 11.375 1.4896 11.375H8.8021C9.02647 11.375 9.20835 11.1931 9.20835 10.9687C9.20835 10.7443 9.02647 10.5625 8.8021 10.5625H8.55325L8.47455 10.3264C8.19807 9.49692 7.42185 8.93745 6.54754 8.93745H3.74417Z" fill="#AEAEAE"/>
                            </svg>
                        </div>
                    </div>
                    <div className={styles.image + " w-11/12 mx-auto overflow-hidden"}>
                        <img className="object-cover w-full" width={98} height={92} src={url + data?.image} alt="icon" />
                    </div>
                    <div className={styles.title + " mt-3"}>
                        <p className="text-[10px] font-bold">
                            {data?.title}
                        </p>
                    </div>
                    {/* <div className={styles.desc}>
                        <p className="text-[#848484] text-[6px]">
                            میل لنگ محور اصلی محرک موتور هر خودرو میباشد  که توسط شاتون ها به حرکت در میآیند و نیرو را از موتور به گیربکس و سپس به دیفرانسیل و در نهایت به چرخ ها منتقل میکند تا خودرو به حرکت دربیاید .
                        </p>
                    </div> */}
                </div>
                <div className={styles.bottom}>
                    <div className={styles.price}>
                        <p className="text-[12px] text-center">
                            {formatNumberWithThousandSeparator(data?.price)} تومان 
                        </p>
                    </div>
                    <div className={styles.footer + " flex items-center justify-between flex-row-reverse mt-1"}>
                        <p className={styles.number + " text-[10px] text-[#8F8F8F]"}>
                            در ۱۲ فروشگاه  
                        </p>
                        <div className={styles.icons + " flex flex-row-reverse gap-2"}>
                            <div className={styles.item}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="12" height="12" viewBox="0 0 8 8" fill="none">
                                    <path d="M4.00002 1.4426C4.06452 1.39576 4.14621 1.34203 4.244 1.28851C4.50715 1.14449 4.89085 1 5.37039 1C5.86599 1 6.36099 1.19923 6.73072 1.59495C7.10159 1.99188 7.33335 2.57172 7.33335 3.3125C7.33335 4.41786 6.54964 5.34157 5.79758 5.96494C5.41489 6.28214 5.02451 6.53496 4.71191 6.70921C4.55566 6.79631 4.41641 6.86514 4.30504 6.91303C4.2496 6.93687 4.19825 6.95674 4.15344 6.97113C4.11706 6.98282 4.05848 7 4.00002 7C3.94156 7 3.88298 6.98282 3.8466 6.97113C3.80179 6.95674 3.75044 6.93687 3.695 6.91303C3.58363 6.86514 3.44438 6.79631 3.28813 6.70921C2.97553 6.53496 2.58515 6.28214 2.20246 5.96494C1.4504 5.34157 0.666687 4.41786 0.666687 3.3125C0.666687 2.57172 0.898446 1.99188 1.26932 1.59495C1.63905 1.19923 2.13405 1 2.62965 1C3.10919 1 3.49289 1.14449 3.75604 1.28851C3.85383 1.34203 3.93552 1.39576 4.00002 1.4426Z" fill="#B6B6B6"/>
                                </svg>
                            </div>
                            <div className={styles.item}>
                                <svg xmlns="http://www.w3.org/2000/svg" width="12" height="12" viewBox="0 0 8 8" fill="none">
                                    <g clip-path="url(#clip0_1114_5277)">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M3.99999 0.666672C2.72463 0.666672 1.63779 1.59226 1.43472 2.85135L1.10682 4.8843C0.984247 5.64425 1.5711 6.33334 2.34087 6.33334H2.50262C2.78568 6.9167 3.33985 7.33333 3.99999 7.33333C4.66013 7.33333 5.21431 6.9167 5.49737 6.33334H5.65911C6.42889 6.33334 7.01573 5.64425 6.89316 4.8843L6.56527 2.85135C6.36219 1.59226 5.27535 0.666672 3.99999 0.666672ZM4.91783 6.33334H3.08216C3.30802 6.6458 3.64204 6.83333 3.99999 6.83333C4.35794 6.83333 4.69197 6.6458 4.91783 6.33334Z" fill="#B6B6B6"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M1.88612 0.743851C1.9812 0.843964 1.97712 1.0022 1.87701 1.09729C1.48281 1.47169 1.18777 1.94886 1.03466 2.4854C0.996768 2.61817 0.858421 2.69508 0.72565 2.65719C0.592879 2.61931 0.515962 2.48096 0.553851 2.34819C0.732059 1.72371 1.07518 1.16927 1.53268 0.734745C1.63279 0.639661 1.79103 0.643738 1.88612 0.743851ZM6.11387 0.743851C6.20896 0.643738 6.3672 0.639661 6.46731 0.734745C6.92481 1.16927 7.26793 1.72371 7.44614 2.34819C7.48403 2.48096 7.40711 2.61931 7.27434 2.65719C7.14157 2.69508 7.00322 2.61817 6.96533 2.4854C6.81222 1.94886 6.51718 1.47169 6.12298 1.09729C6.02287 1.0022 6.01879 0.843964 6.11387 0.743851Z" fill="#B6B6B6"/>
                                    </g>
                                    <defs>
                                    <clipPath id="clip0_1114_5277">
                                    <rect width="8" height="8" fill="white"/>
                                    </clipPath>
                                    </defs>
                                </svg>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </Link>
    )
}

export default MobileShopItem;