const PrivacyPolicy = () => {
    return(
        <div>
            <div className="container max-w-[1200px] w-11/12 mx-auto my-20 flex flex-col gap-10">
                <div className="bg-[#2D2C2C] p-5 rounded-lg">
                    <p className="text-white text-2xl font-bold max-md:text-lg">
                        قوانین و مقررات
                    </p>
                </div>
                <div className="flex flex-col gap-6 bg-white p-4 rounded-lg">
                    <div className="flex flex-col gap-4">
                        <h2 className="text-xl font-bold max-md:text-lg">
                            شرایط بازگشت کالا   
                        </h2>
                        <p className="leading-9 max-md:text-sm">
                            کالایی که دارای مشکل سخت افزاری بوده و یا مشخصات کالای ارسال شده با مشخصات مندرج در سایت و فاکتور مغایرت داشته باشد، شما میتوانید ظرف مدت 7 روز از تاریخ تحویل کالا، آن را بازگشت دهید. دقت نمایید این 7 روز به صورت کاری محاسبه نمی گردد.لغو یا انصراف سفارش پس از تحویل کالا فقط تا 48 ساعت بعد از تحویل بدست شما امکان پذیر است که از لحاظ ظاهری کالا بایستی پلمب و بدون ضربه خوردگی باشد. هزینه حمل بازگشت کالا و ارسال کالای جایگزین به عهده شما می باشد.مدت زمان بازگشت کالا جهت بررسی تا 48 ساعت از زمان تحویل به آی تی لند 24 زمان می برد.در مواردی که ایراد توسط مشتری یا ایراد ذاتی خود دستگاه باشد ، بررسی توسط گارانتی تا یک هفته کاری به طول می انجامد. ایرادات فیزیکی مانند شکستگی، ضربه، خط و خش و… شامل ضمانت بازگشت کالا نمی باشد پس در زمان تحویل کالا به بسته بندی و محتویات داخل آن دقت نمائید. لطفا در هنگام جعبه گشایی از سفارش خود فیلم تهیه نمایید تا اگر سفارش در حین نقل و انتقال آسیب دیده بود از طریق فیلم قابل اثبات باشد (در غیر این صورت امکان مرجوعی کالا با مشکل فیزیکی و ظاهری وجود ندارد). تا 3 پیکسل سوخته شامل ضمانت بازگشت کالا نمی شود. ایرادات نرم افزاری و استفاده نادرست شامل ضمانت بازگشت کالا نمی شود. مدت زمان گارانتی کالا ها روی کارت گارانتی درج شده و فقط تاریخ درج شده روی کارت معتبر است (برخلاف باور عموم که گفته می شود تاریخ شروع گارانتی از تاریخ فاکتور می باشد). لطفا در زمان تحویل کالا وجود اقلام همراه و کارت گارانتی دستگاه را نیز بررسی نمایید (در صورت مفقود شدن اقلام همراه و یا کارت گارانتی امکان تعویض و یا مرجوعی کالا وجود نخواهد داشت) وجه بازگشتی به مشتریان گرامی تنها به حساب شخصی که سفارش را ثبت کرده و با ارائه کد ملی انجام می پذیرد. پس از اتمام ضمانت بازگشت کالا، خدمات گارانتی و پشتیبانی برعهده شرکتی است که در هر محصول به عنوان گارانتی قید شده است. در مورد کالاهایی که تنها دارای گارانتی اصالت و سلامت فیزیکی می باشند، مهلت تست برای تهران 24 ساعت و برای شهرستان 72 ساعت از تاریخ تحویل می باشد و این محصول شامل ضمانت 7 روز بازگشت کالا نمی شوند.
                        </p>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default PrivacyPolicy